src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КурсыВалют/Ext/ManagerModule.bsl
Функция СуммаВРублях(СуммаВВалюте, Валюта, ДатаКурса) Экспорт
	
	СуммаВРублях = 0;
	
	// 1. Обработать случа когда Валюта - Российский рубль
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		Возврат СуммаВВалюте;	
	КонецЕсли;
	
	// 2. Получить курс валюты.
	
	Отбор = Новый Структура;
	Отбор.Вставить("Валюта", Валюта);
	ДанныеОКурсе = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Отбор);
	
	// 3. Рассчитать сумму в рублях по курсу
	
	Если ЗначениеЗаполнено(ДанныеОКурсе) Тогда	
		СуммаВРублях = СуммаВВалюте * ДанныеОКурсе.Курс / ДанныеОКурсе.Кратность;
	Иначе
	КонецЕсли;
	
	Возврат	СуммаВРублях;
	
КонецФункции

Функция СуммаВВалюте(СуммаВРублях, Валюта, ДатаКурса) Экспорт
	
	СуммаВВалюте = 0;
	
	// 1. Обработать случа когда Валюта - Российский рубль
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		Возврат СуммаВРублях;	
	КонецЕсли;
	
	// 2. Получить курс валюты.
	
	//Отбор = Новый Структура;
	//Отбор.Вставить("Валюта", Валюта);
	//ДанныеОКурсе = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Отбор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаКурса", ДатаКурса);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Результат = Запрос.Выполнить();
	
	
	
	Если Результат.Пустой() Тогда
				
	Иначе
		ДанныеОКурсе = Результат.Выбрать();
		ДанныеОКурсе.Следующий();
		
		// 3. Рассчитать сумму в рублях по курсу
		СуммаВВалюте = СуммаВРублях / ДанныеОКурсе.Курс * ДанныеОКурсе.Кратность;
	КонецЕсли;
	
	Возврат	СуммаВВалюте;
	
КонецФункции
